app/controllers/authentications_controller.rb

SELECT  `authentications`.* FROM `authentications` WHERE `authentications`.`provider` = 'twitter' AND `authentications`.`uid` = '118982962' LIMIT 1
---
  def twitter
    omniauth = request.env["omniauth.auth"]
    authentication = Authentication.find_by_provider_and_uid(omniauth['provider'], omniauth['uid'])